In [37]:
import sqlalchemy
import pymysql
from sqlalchemy import create_engine
import pandas as pd

In [38]:
password = 'Malekquin2003'
db_name = 'payroll'

In [39]:
df=pd.read_csv("Payroll - Employees.csv")

In [40]:
df1=pd.read_csv("Payroll - Departments.csv")

In [41]:
df2=pd.read_csv("Payroll - Salaries.csv")

In [42]:
df3=pd.read_csv("Payroll - Taxes.csv")

In [43]:
conn = pymysql.connect(host='127.0.0.1', port=3306, user='root', password=password, database=db_name)

In [44]:
connection = create_engine("mysql+pymysql://root:" + password + "@localhost:3306/" + db_name)

In [45]:
table_name = 'employees'
df.to_sql(name=table_name, con=connection, if_exists='replace', index=False)

20

In [46]:
table_name = 'departments'
df1.to_sql(name=table_name, con=connection, if_exists='replace', index=False)

5

In [47]:
table_name = 'salaries'
df2.to_sql(name=table_name, con=connection, if_exists='replace', index=False)

20

In [48]:
table_name = 'taxes'
df3.to_sql(name=table_name, con=connection, if_exists='replace', index=False)

6

In [49]:
query = """
CREATE TABLE data AS
SELECT * FROM employees
LEFT JOIN departments
ON departments.department_ID=employees.Dpt_ID
LEFT JOIN salaries
ON salaries.salary_id=employees._id
LEFT JOIN taxes
ON taxes.tx_id=employees.Tax_ID
"""
result_df = pd.read_sql(query, con=connection)
result_df

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [50]:
query1 = """
ALTER TABLE data
DROP COLUMN department_ID,
DROP COLUMN salary_id,
DROP COLUMN tx_id;
"""
result_df1 = pd.read_sql(query1, con=connection)
result_df1

ResourceClosedError: This result object does not return rows. It has been closed automatically.

In [66]:
query2 = """
SELECT first_name AS First_Name, last_name AS Last_Name, base_salary AS Base_Salary, ((base_salary + bonus - deductions)*((100-tax_rate)/100)) AS Salary FROM data
"""
result_df2 = pd.read_sql(query2, con=connection)
result_df2

   First_Name Last_Name  Base_Salary     Salary
0         Jim  Reynolds       127708   99338.08
1       Sarah     Brown        55192   46781.28
2         Ben     Smith       100057   78629.46
3        Kate   Dickson       123349  110923.12
4          Al     White        71440   64026.00
5      Olivia   Johnson        70609   63638.10
6        Emma  Williams        99100   86944.00
7    Isabella     Jones        57751   48930.84
8        Liam    Garcia        93757   73208.46
9        Noah    Miller        81228   55167.04
10     Amelia     Davis        86230   67358.80
11      Lucas  Martinez        71758   49543.44
12  Charlotte     Lopez        95413   64812.84
13        Leo    Taylor        85730   78507.00
14      Kevin       Lee       101668   81641.04
15       Lily     Allen       114395   89866.20
16      Ethan      Hill        58444   44645.44
17        Mia    Nguyen        69946   58712.64
18      Chris      King       107245   96179.60
19     Evelyn     Moore        81959   71507.92

In [67]:
query3 = """
SELECT location AS City, AVG(((base_salary + bonus - deductions)*((100-tax_rate)/100))) AS Salary FROM data GROUP BY location;
"""
result_df3 = pd.read_sql(query3, con=connection)
result_df3

          City        Salary
0     New York  81959.776000
1  Los Angeles  53153.590000
2      Chicago  74448.613333
3      Houston  71102.624000
4       Boston  76363.033333

In [55]:
query4 = """
SELECT manager, AVG(((base_salary + bonus - deductions)*((100-tax_rate)/100))) AS salary FROM data GROUP BY manager;
"""
result_df4 = pd.read_sql(query4, con=connection)
result_df4

        manager        salary
0          John  70048.453333
1       Miranda  94776.290000
2         Avery  68423.280000
3       Matthew  86944.000000
4       Madison  48930.840000
5           Zoe  55167.040000
6        Austin  78612.500000
7        Joseph  49543.440000
8          Lucy  77500.120000
9          Leah  80074.020000
10      Charlie  44645.440000
11  Christopher  58712.640000

In [68]:
query5 = """
SELECT tax_rate AS Tax_Rate, AVG(((base_salary + bonus - deductions)*((100-tax_rate)/100))) AS Salary FROM data GROUP BY tax_rate ORDER BY salary DESC;
"""
result_df5 = pd.read_sql(query5, con=connection)
result_df5

   Tax_Rate        Salary
0        12  91388.660000
1        22  77826.320000
2        24  75302.130000
3        10  68723.700000
4        32  56507.773333
5        16  51474.920000